 [  {  "contentId": "12579",  "rating": 4.3,  "tomato": 66,  "year": "1996",  "genre": "Action | Suspense | Adventure",  "vuduurl": "http://www.vudu.com/movies/#!content/12579/The-Rock",  "city": "San Francisco",  "destination": "The palace of fine art",  "latitude": 37.8020687,  "longitude": -122.4509549,  "title": "The Rock",  "snippet": "Mason seeks out his estranged daughter Jade at The Palace of Fine Art",  "scenes": ["12579_0","12579_1","12579_2"],  "synopsis": "A Brigadier General takes over Alcatraz Island and threatens an attack on San Francisco. It is up to an FBI weapons expert and an ex convict, the only one who had ever escaped from Alcatraz, to infiltrate the island before disaster strikes. "  },  {  "contentId": "8914",  "rating": 4.0,  "tomato": 58,  "year": "2006",  "genre": "Action | Sci-Fi | Adventure",  "vuduurl": "http://www.vudu.com/movies/#!content/8914/X-Men-The-Last-Stand",  "city": "San Francisco",  "destination": "Golden Gate",  "latitude": 37.8199328,  "longitude": -122.4984438,  "title": "X-Men: The Last Stand",  "snippet": "Golden gate bridge was teared down by Magneto!",  "scenes": ["8914_0"],  "synopsis": "Join well-known mutant heroes and villains, and meet a cadre of all-new warriors -- including Angel, Beast, Juggernaut and Colossus -- in this thrilling, explosive adventure! After a controversial cure is discovered, mutants can choose to retain their superhuman abilities or give up their unique gifts and become normal. When peaceful mutant leader Charles Xavier clashes with his militant counterpart, Magneto, the battle lines are drawn for the war to end all wars."  },  {  "contentId": "197950",  "rating": 4.2,  "tomato": 88,  "year": "2011",  "genre": "Action | Sci-Fi | Adventure",  "vuduurl": "http://www.vudu.com/movies/#!content/197950/Rise-of-the-Planet-of-the-Apes",  "city": "San Francisco",  "destination": "Golden Gate",  "latitude": 37.8199328,  "longitude": -122.4804438,  "title": "Rise of the Planet of the Apes",  "snippet": "Apes free apes from the San Francisco Zoo",  "scenes": ["197950_0"],  "synopsis": "RISE OF THE PLANET OF THE APES is a revolution; an action-packed epic featuring stunning visual effects and creatures unlike anything ever seen before. At the story's heart is Caesar (Andy Serkis), a chimpanzee who gains human-like intelligence and emotions from an experimental drug. Raised like a child by the drug's creator (James Franco), Caesar ultimately finds himself taken from the humans he loves and imprisoned. Seeking justice, Caesar assembles a simian army and escapes -- putting man and primate on a collision course that could change the planet forever."  },  {  "contentId": "629657",  "rating": 4.0,  "tomato": 72,  "year": "2014",  "genre": "Comedy | Drama",  "vuduurl": "http://www.vudu.com/movies/#!content/629657/Big-Eyes",  "city": "San Francisco",  "destination": "Store",  "latitude": 37.806142,  "longitude": -122.421884,  "title": "Big eyes",  "snippet": "Walter opens up his own Keane gallery in San Francisco",  "scenes": ["629657_0", "629657_1", "629657_2", "629657_3", "629657_4"],  "synopsis": "From visionary director Tim Burton (EDWARD SCISSORHANDS) comes the outrageous true story of one of the most extensive art frauds in the 20th century. Starring Christoph Waltz and Amy Adams."  },  {  "contentId": "534815",  "rating": 4.0,  "tomato": 74,  "year": "2014",  "genre": "Action | Sci-Fi | Fantasy",  "vuduurl": "http://www.vudu.com/movies/#!content/534815/Godzilla",  "city": "San Francisco",  "destination": "Golden Gate",  "latitude": 37.8199328,  "longitude": -122.4704438,  "title": "Godzilla",  "snippet": "Godzilla loves tearing down bridges",  "scenes": ["534815_0"],  "synopsis": "The world's most revered monster is reborn as visionary new director Gareth Edwards unleashes the epic action adventure GODZILLA, a powerful story of human courage and reconciliation in the face of titanic forces of nature -- when the awe-inspiring creature rises to restore balance as humanity stands defenseless. This spectacular adventure pits the world's most famous monster against malevolent creatures that, bolstered by humanity's scientific arrogance, threaten our very existence."  },  {  "contentId": "669928",  "rating": 4.4,  "tomato": 98,  "year": "2015",  "genre": "Comedy | Family | Adventure",  "vuduurl": "http://www.vudu.com/movies/#!content/669928/Inside-Out",  "city": "San Francisco",  "destination": "Lombard Street",  "latitude": 37.8021432,  "longitude": -122.4209287,  "title": "Inside Out",  "snippet": "Riley Andersen and her 5 personalities live in the heart of San Francisco",  "scenes": ["669928_0"],  "synopsis": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy (Amy Poehler), Fear (Bill Hader), Anger (Lewis Black), Disgust (Mindy Kaling) and Sadness (Phyllis Smith). The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school."  },  {  "contentId": "607384",  "rating": 4.6,  "tomato": 89,  "year": "2014",  "genre": "Action | Family | Adventure",  "vuduurl": "http://www.vudu.com/movies/#!content/607384/Big-Hero-6",  "city": "San Francisco",  "destination": "San Fransokyo",  "latitude": 37.7907086,  "longitude": -122.4209579,  "title": "Big Hero 6",  "snippet": "Hiro Hamada is a 14-year-old robotics genius in the futuristic fictional city of San Fransokyo",  "scenes": ["607384_0","607384_1"],  "synopsis": "From Walt Disney Animation Studios comes an action-packed comedy adventure about robotics prodigy Hiro Hamada and his personal companion robot Baymax, who team up with a band of unlikely heroes to save the city of San Fransokyo from a criminal plot."  },  {  "contentId": "14817",  "rating": 4.2,  "tomato": 85,  "year": "1986",  "genre": "Action | Sci-Fi | Fantasy",  "vuduurl": "http://www.vudu.com/movies/#!content/14817/Star-Trek-4-The-Voyage-Home",  "city": "San Francisco",  "destination": "Golden Gate",  "latitude": 37.8009328,  "longitude": -122.4804438,  "title": "Star Trek IV: The Voyage Home",  "snippet": "Arriving in 1986, the crew finds their ship's power drained. Hiding their ship in San Francisco's Golden Gate Park using its cloaking device",  "scenes": ["14817_0"],  "synopsis": "A huge alien probe has entered the galaxy and begins to vaporize earths oceans. Spock determines the probes' signal is meant for whales which are now extinct. Kirk and his crew must travel back in time in order to bring back whales and save the planet."  }  ]